---
kind: property
id: P:Autodesk.Revit.DB.ScheduleField.VerticalAlignment
source: html/fef1e171-3925-16f5-2a3e-49b3583773ff.htm
---
# Autodesk.Revit.DB.ScheduleField.VerticalAlignment Property

The vertical alignment of the column's data.

## Syntax (C#)
```csharp
public ScheduleVerticalAlignment VerticalAlignment { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration